messages sample/WrongOrderElementVaildationExampleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mov="http://www.abstract.com/movies-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <mov:addMovieRequest>
         <mov:category>Teste de Validação</mov:category>
         <mov:title>Teste</mov:title>
      </mov:addMovieRequest>
   </soapenv:Body>
</soapenv:Envelope>